# PyCity School Analysis

Write analysis here....

In [2]:
import pandas as pd 
from pathlib import Path

In [3]:
school_path = Path("Resources/schools_complete.csv")
student_path = Path("Resources/students_complete.csv")

In [4]:
school_data_df = pd.read_csv(school_path)
student_data_df = pd.read_csv(student_path)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
all_school_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
all_school_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [6]:
all_school_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

# District Summary

In [7]:
#school count
school_count = len(all_school_df["school_name"].unique())
print(school_count)

15

In [8]:
#total students
student_count = len(all_school_df["Student ID"].unique())
print(student_count)

39170

In [9]:
#budget total
budget_total = school_data_df["budget"].sum()
budget_total

24649428

In [10]:
#average math score
math_average = all_school_df["math_score"].mean()
math_average

78.98537145774827

In [11]:
#average reading score 
reading_average = all_school_df ["reading_score"].mean()
reading_average

81.87784018381414

In [12]:
#percent of students who passed math
math_pass_total = all_school_df[(all_school_df["math_score"] >= 70)].count()["student_name"]
math_pass_percent = math_pass_total / float(student_count) * 100
math_pass_percent

74.9808526933878

In [13]:
#percent of students who passed reading
reading_pass_total = all_school_df[(all_school_df["reading_score"] >= 70)].count()["student_name"]
reading_pass_percent = reading_pass_total / float(student_count) * 100
reading_pass_percent

85.80546336482001

In [14]:
#percent of students that passed math AND reading
math_reading_pass_total = all_school_df[
    (all_school_df["math_score"] >= 70) & (all_school_df["reading_score"] >= 70)].count()["student_name"]
overall_pass_rate = math_reading_pass_total / float(student_count) * 100
overall_pass_rate

65.17232575950983

In [15]:
#put the district summary into a DataFrame: "Total Schools", "Total Students",
#"Total Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
#"% Overall Passing"

district_summary = pd.DataFrame({"Total Schools": [school_count],
                                "Total Students": [student_count],
                                "Total Budget": [budget_total],
                                "Average Math Score": [math_average], 
                                "Average Reading Score": [reading_average],
                                "% Passing Math": [math_pass_percent],
                                "% Passing Reading": [reading_pass_percent],
                                "% Overall Passing": overall_pass_rate})

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [16]:
# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

# School Summary

In [17]:
all_school_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [18]:
all_school_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [84]:
#school names
#school_names = (all_school_df["school_name"])
#print(school_names)

#school_names = (all_school_df["school_name"].unique())
#school_names

#school names using group
#school_name_group = all_school_df.groupby(["School ID"])
#grouped_students.count()
#school_names = school_name_group[["school_name"]].count()
#school_names

0         Huang High School
1         Huang High School
2         Huang High School
3         Huang High School
4         Huang High School
                ...
39165    Thomas High School
39166    Thomas High School
39167    Thomas High School
39168    Thomas High School
39169    Thomas High School
Name: school_name, Length: 39170, dtype: object

In [144]:
#school name using a dictionary???
school_name_dict = [{"School Name": "Huang High School"},
                    {"School Name": "Figueroa High School"},
                    {"School Name": "Shelton High School"},
                    {"School Name": "Hernandez High School"},
                    {"School Name": "Griffin High School"},
                    {"School Name": "Wilson High School"},
                    {"School Name": "Cabrera High School"},
                    {"School Name": "Bailey High School"},
                    {"School Name": "Holden High School"},
                    {"School Name": "Pena High School"},
                    {"School Name": "Wright High School"},
                    {"School Name": "Rodriguez High School"},
                    {"School Name": "Johnson High School"},
                    {"School Name": "Ford High School"},
                    {"School Name": "Thomas High School"}]

school_name_dict
school_df = pd.DataFrame(school_name_dict)
school_df

#'Huang High School', 'Figueroa High School', 'Shelton High School',
#       'Hernandez High School', 'Griffin High School',
#       'Wilson High School', 'Cabrera High School', 'Bailey High School',
#       'Holden High School', 'Pena High School', 'Wright High School',
#       'Rodriguez High School', 'Johnson High School', 'Ford High School',
#       'Thomas High School'

              School Name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [86]:
#school type
#school_type = (all_school_df["type"])
#print(school_type)

#school_size = (all_school_df["size"].unique())
#school_size

#school names using group
#school_type_group = all_school_df.groupby(["School ID"])
#grouped_students.count()
#school_names = grouped_students[["school_name"]].count()
#school_names

0        District
1        District
2        District
3        District
4        District
           ...
39165     Charter
39166     Charter
39167     Charter
39168     Charter
39169     Charter
Name: type, Length: 39170, dtype: object

In [146]:
#school type using a dictionary???
school_type_dict = [{"School Type": "District"},
                    {"School Type": "District"},
                    {"School Type": "Charter"},
                    {"School Type": "District"},
                    {"School Type": "Charter"},
                    {"School Type": "Charter"},
                    {"School Type": "Charter"},
                    {"School Type": "District"},
                    {"School Type": "Charter"},
                    {"School Type": "Charter"},
                    {"School Type": "Charter"},
                    {"School Type": "District"},
                    {"School Type": "District"},
                    {"School Type": "District"},
                    {"School Type": "Charter"}]

school_type_dict
type_df = pd.DataFrame(school_type_dict)
type_df

   School Type
0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter

In [26]:
#trying another way to sort
#school_id_df = all_school_df.sort_values("School ID", ascending=True)
#school_id_df = all_school_df.reset_index(drop=True)
#school_id_df

In [27]:
#need to sort by 'School ID'
#school_ID_sort_df = all_school_df.sort_values("School ID")
#school_ID_sort_df

In [28]:
#new_index_school_id = school_ID_sort_df.reset_index(drop=True)
#new_index_school_id

In [134]:
#school name
school_name = (all_school_df["school_name"].unique())
school_name

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [88]:
#school name by group
#school_name2 = all_school_df.groupby(["school_name"])
#school_name_all = school_name2 ["school_name"].count()
#school_name_all

In [89]:
#school ID
#school_id = (all_school_df["School ID"].unique())
#school_id

In [160]:
#school type  - district, charter - column 'type'
school_type = (school_data_df["type"])
school_type

0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter
Name: type, dtype: object

In [159]:
#students per school using group
#grouped_students = all_school_df.groupby(["school_name"])
#grouped_students.count()
#student_size = grouped_students[["size"]].count()
#student_size

student_size = (school_data_df["size"])
print(student_size)

0     2917
1     2949
2     1761
3     4635
4     1468
5     2283
6     1858
7     4976
8      427
9      962
10    1800
11    3999
12    4761
13    2739
14    1635
Name: size, dtype: int64

In [101]:
student_size.dtypes

dtype('int64')

In [102]:
#total students per school ###old code but may need again ##this needs to be a groupby
#school_size = (all_school_df["size"].unique())
#school_size

#school_size = (all_school_df["size"])
#print(school_size)

In [103]:
#grouped_school_size = all_school_df.groupby(["school_name"])
#grouped_school_size.count()
#school_size_total = (grouped_school_size[["size"]].count())
#school_size_total

In [104]:
#school_size2 = all_school_df[(all_school_df["size"])]
#school_size_group = school_size2.groupby(["school_name"]).count()

#school_size_group

#use iloc?

In [105]:
#school_size3 = school_data_df.loc[:, ["School ID", "size"]]
#school_size3

In [165]:
#budget per school
#budget_per_school = (all_school_df["budget"].unique())
#budget_per_school

budget_per_school = (school_data_df["budget"])
print(budget_per_school)

0     1910635
1     1884411
2     1056600
3     3022020
4      917500
5     1319574
6     1081356
7     3124928
8      248087
9      585858
10    1049400
11    2547363
12    3094650
13    1763916
14    1043130
Name: budget, dtype: int64

In [108]:
all_school_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [109]:
#calculate size
#school_size = (all_school_df["size"].unique())
#school_size

In [167]:
#budget per capita
budget_per_capita = budget_per_school / student_size
budget_per_capita

0     655.0
1     639.0
2     600.0
3     652.0
4     625.0
5     578.0
6     582.0
7     628.0
8     581.0
9     609.0
10    583.0
11    637.0
12    650.0
13    644.0
14    638.0
dtype: float64

In [113]:
grouped_school_name = all_school_df.groupby(["School ID"])

In [114]:
grouped_school_name[["math_score"]].sum()

           math_score
School ID
0              223528
1              226223
2              146796
3              358238
4              122360
5              190115
6              154329
7              383393
8               35784
9               80654
10             150628
11             307294
12             366942
13             211184
14             136389

In [116]:
#average test score per school for MATH
#first find the total math score per school

math_average_school = grouped_school_name["math_score"].mean()
math_average_school

School ID
0     76.629414
1     76.711767
2     83.359455
3     77.289752
4     83.351499
5     83.274201
6     83.061895
7     77.048432
8     83.803279
9     83.839917
10    83.682222
11    76.842711
12    77.072464
13    77.102592
14    83.418349
Name: math_score, dtype: float64

In [117]:
#average test score per school for READING
grouped_school_name[["reading_score"]].sum()

           reading_score
School ID
0                 236810
1                 239335
2                 147441
3                 375131
4                 123043
5                 191748
6                 156027
7                 403225
8                  35789
9                  80851
10                151119
11                322898
12                385481
13                221164
14                137093

In [118]:
reading_average_school = grouped_school_name["reading_score"].mean()
reading_average_school

School ID
0     81.182722
1     81.158020
2     83.725724
3     80.934412
4     83.816757
5     83.989488
6     83.975780
7     81.033963
8     83.814988
9     84.044699
10    83.955000
11    80.744686
12    80.966394
13    80.746258
14    83.848930
Name: reading_score, dtype: float64

In [120]:
#students passing math by school
students_passing_math = all_school_df[(all_school_df["math_score"] >= 70)]
students_passing_math_school = students_passing_math.groupby(["School ID"]).size()

students_passing_math_school

School ID
0     1916
1     1946
2     1653
3     3094
4     1371
5     2143
6     1749
7     3318
8      395
9      910
10    1680
11    2654
12    3145
13    1871
14    1525
dtype: int64

In [122]:
per_school_passing_math = students_passing_math_school / school_size * 100
per_school_passing_math

School ID
0     65.683922
1     65.988471
2     93.867121
3     66.752967
4     93.392371
5     93.867718
6     94.133477
7     66.680064
8     92.505855
9     94.594595
10    93.333333
11    66.366592
12    66.057551
13    68.309602
14    93.272171
dtype: float64

In [123]:
#students passing reading by school
students_passing_reading = all_school_df[(all_school_df["reading_score"] >= 70)]
students_passing_reading_school = students_passing_reading.groupby(["School ID"]).size()

students_passing_reading_school

School ID
0     2372
1     2381
2     1688
3     3748
4     1426
5     2204
6     1803
7     4077
8      411
9      923
10    1739
11    3208
12    3867
13    2172
14    1591
dtype: int64

In [124]:
per_school_passing_reading = students_passing_reading_school / school_size * 100
per_school_passing_reading

School ID
0     81.316421
1     80.739234
2     95.854628
3     80.862999
4     97.138965
5     96.539641
6     97.039828
7     81.933280
8     96.252927
9     95.945946
10    96.611111
11    80.220055
12    81.222432
13    79.299014
14    97.308869
dtype: float64

In [174]:
#students that passed math and reading
#students_passing_math_and_reading = all_school_df[
#    (all_school_df["reading_score"] >= 70) & (all_school_df["math_score"] >= 70)
#]

#school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["School ID"]).size()
#school_students_passing_math_and_reading


#students passing math AND reading by school
students_passing_math_and_reading = all_school_df[(all_school_df["reading_score"] >= 70) & (all_school_df["math_score"] >= 70)]

students_passing_math_and_reading_school = students_passing_math_and_reading.groupby(["School ID"]).size()
students_passing_math_and_reading_school

#students_passing_reading_school

#per_school_passing_reading = students_passing_reading_school / school_size * 100
#per_school_passing_reading

School ID
0     1561
1     1569
2     1583
3     2481
4     1330
5     2068
6     1697
7     2719
8      381
9      871
10    1626
11    2119
12    2549
13    1487
14    1487
dtype: int64

In [177]:
#overall passing
overall_passing_rate = students_passing_math_and_reading_school / school_size * 100

#overall_passing_rate_schools = overall_passing_rate.groupby(["School ID"]).size()
overall_passing_rate

School ID
0     53.513884
1     53.204476
2     89.892107
3     53.527508
4     90.599455
5     90.582567
6     91.334769
7     54.642283
8     89.227166
9     90.540541
10    90.333333
11    52.988247
12    53.539172
13    54.289887
14    90.948012
dtype: float64

In [179]:
#NEED TO CREATE DATAFRAME

#merge school_names and school_type DF


per_school_summary = pd.DataFrame({" ": ["Huang High School", "Figueroa High School", "Shelton High School",
                                        "Hernandez High School", "Griffin High School", "Wilson High School",
                                        "Cabrera High School", "Bailey High School", "Holden High School",
                                        "Pena High School", "Wright High School", "Rodriguez High School",
                                        "Johnson High School", "Ford High School", "Thomas High School"],
                                   "School Type": ["District", "Distrtict", "Charter", "District", "Charter", "Charter", 
                                                   "Charter", "District", "Charter", "Charter", "Charter", "District", 
                                                   "District", "District", "Charter"],
                                  "Total Students": [2917, 2949, 1761, 4635, 1468, 2283, 1858, 4976, 
                                                   427, 962, 1800, 3999, 4761, 2739, 1635],
                                  "Total School Budget": [1910635, 1884411, 1056600, 3022020, 917500, 1319574, 1081356,
                                                          3124928, 248087, 585858, 1049400, 2547363, 3094650, 1763916, 1043130],
                                  "Per Student Budget": [655.00, 639.00, 600.00,  652.00, 625.00, 578.00, 582.00, 628.00,
                                                         581.00, 609.00, 583.00, 637.00, 650.00, 644.00, 638.0],
                                  "Average Math Score": [76.629414, 76.711767, 83.359455, 77.289752, 83.351499, 83.274201,
                                                         83.061895, 77.048432, 83.803279, 83.839917, 83.682222, 76.842711,
                                                         77.072464, 77.102592, 83.418349],
                                  "Average Reading Score": [81.182722, 81.158020, 83.725724, 80.934412, 83.816757, 83.989488,
                                                            83.975780, 81.033963, 83.814988, 84.044699, 83.955000, 80.744686,
                                                            80.966394, 80.746258, 83.848930],
                                  "% Passing Math": [65.683922, 65.988471, 93.867121, 66.752967, 93.392371, 93.867718, 
                                                     94.133477, 66.680064, 92.505855, 94.594595, 93.333333, 66.366592,
                                                     66.057551, 68.309602, 93.272171],
                                  "% Passing Reading": [81.316421, 80.739234, 95.854628, 80.862999, 97.138965, 96.539641, 
                                                        97.039828, 81.933280, 96.252927, 95.945946, 96.611111, 80.220055, 
                                                        81.222432, 79.299014, 97.308869],
                                  "% Overall Passing": [53.513884, 53.204476, 89.892107, 53.527508, 90.599455, 90.582567, 
                                                        91.334769, 54.642283, 89.227166, 90.540541, 90.333333, 52.988247, 
                                                        53.539172, 54.289887, 90.948012]})

per_school_summary["Total School Budget"] = per_school_summary["Total School Budget"].map("${:,.2f}".format)
per_school_summary["Per Student Budget"] = per_school_summary["Per Student Budget"].map("${:,.2f}".format)

per_school_summary

,,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
1,Figueroa High School,Distrtict,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,93.867121,95.854628,89.892107
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
5,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
6,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
7,Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
8,Holden High School,Charter,427,"$248,087.00",$581.00,83.803279,83.814988,92.505855,96.252927,89.227166
9,Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541
10,Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.682222,83.955000,93.333333,96.611111,90.333333
11,Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
12,Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172
13,Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
14,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012

In [180]:
#sort by school name A-Z
final_school_summary = per_school_summary.sort_values ([" "], ascending=True)
final_school_summary

,,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
7,Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
6,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
1,Figueroa High School,Distrtict,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
13,Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
8,Holden High School,Charter,427,"$248,087.00",$581.00,83.803279,83.814988,92.505855,96.252927,89.227166
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
12,Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172
9,Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541
11,Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,93.867121,95.854628,89.892107
14,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
5,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
10,Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.682222,83.955000,93.333333,96.611111,90.333333